/*REXX*/                                                               
"ALLOC FILE (TEMP2) DATASET('PRPT.L991494.REXX') SHR REUSE"            
"CALL *(BPXWDYN) 'CONCAT DDLIST(SYSPROC,TEMP2)'"                       